app/views/users/show.html.haml

      Projects:
    - @user.projects.each do |project|
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1

      Skill Tags:
    - @user.tags.each do |tag|
---
SELECT "tags".* FROM "tags" INNER JOIN "tags_users" ON "tags"."id" = "tags_users"."tag_id" WHERE "tags_users"."user_id" = 1