app/views/shared/_project.html.haml

				Tags:
				-project.tags.each do |tag|
---
SELECT "tags".* FROM "tags" INNER JOIN "projects_tags" ON "tags"."id" = "projects_tags"."tag_id" WHERE "projects_tags"."project_id" = 1