app/views/projects/index.html.haml

          %td= link_to "More about #{project.title}", project_path(project)
          - project.tags.each do |tag|
---
SELECT "tags".* FROM "tags" INNER JOIN "projects_tags" ON "tags"."id" = "projects_tags"."tag_id" WHERE "projects_tags"."project_id" = 1