app/controllers/admin_notifications_controller.rb

	def destroy
    @notification = AdminNotification.find(params[:id])
		if params[:user]
			User.confirm_user(params)
		end
		if params[:project]
			Project.confirm_project(params)
		end
    @notification.destroy
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."type" IN ('AdminNotification') AND "notifications"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "notifications" WHERE "notifications"."type" IN ('AdminNotification') AND "notifications"."id" = ?  [["id", 1]]