app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 4]]
---
	def destroy
    @notification = Notification.find(params[:id])
		@user = @notification.user
    @notification.destroy