app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE (projects.confirmed_at IS NOT NULL) AND (title LIKE '%project1%' OR description LIKE '%project1%' OR owner LIKE '%project1%')
---
	def index
		projectsort = params[:projectsort] || session[:projectsort]
    case projectsort
    when 'title'
      ordering,@title_header = :title, 'hilite'
    when 'owner'
      ordering,@owner_header = :owner, 'hilite'
    when 'deadline'
      ordering,@deadline_header = :deadline, 'hilite'
    end
    if params[:projectsort] != session[:projectsort]
      session[:projectsort] = projectsort
      flash.keep
      redirect_to :projectsort => projectsort and return
    end
		if ordering != 'deadline'
			ordering = "lower(#{ordering})" unless ordering == nil
		end
		if params[:search_string] != nil
			attrib = params[:search_type][:selected]
			search = params[:search_string]
			@projects = Project.where("projects.confirmed_at IS NOT NULL").order(ordering).search(search,attrib)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		confirmed_project(params[:id])
		id = params[:id]
    	@project = Project.find(id)

INSERT INTO "projects" ("confirmed_at", "created_at", "deadline", "description", "owner", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "projects" SET "user_id" = 1, "updated_at" = '2013-05-01 01:59:17.676755' WHERE "projects"."id" = 3
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 01 May 2013 01:59:17 UTC +00:00], ["name", "new tag"], ["updated_at", Wed, 01 May 2013 01:59:17 UTC +00:00]]
---
	def create
		if !deadline_validator(params[:project][:deadline])
			flash[:notice] = "Invalid deadline."
			redirect_to new_project_path
		else
			@project = Project.create!(params[:project])
	 		@user = current_user
			@project.owner = @user.username
			@project.save!
			# Project.unconfirmed_project(@project, @user)
      # This will make it so projects need to be authorized, get rid of line below
      @project.confirmed_at = Time.now
      if (params[:tags] != nil && params[:tags].size != 0)
        @tags = params[:tags].split(" ")
        @tags.each do |tag|
          if @tag = Tag.find_by_name(tag)
						@project.tags << @tag

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @project = Project.find params[:id]

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "description" = 'Donec vulputate neque ut augue venenatis a tincidunt libero semper. Nunc in elementum leo. Sed dictum nibh sit amet diam facilisis semper. Nam id tincidunt tellus. Duis non nisl magna. In semper tempor ornare. Cras laoreet ultrices vestibulum. Morbi ac mauris risus, in molestie purus. Aliquam quis urna tellus. Ut id justo vitae nisl adipiscing scelerisque. Ut bibendum massa et est eleifend nec blandit dolor porta. Nullam elementum mattis egestas.Donec vulputate neque ut augue venenatis a tincidunt libero semper. Nunc in elementum leo. Sed dictum nibh sit amet diam facilisis semper. Nam id tincidunt tellus. Duis non nisl magna. In semper tempor ornare. Cras laoreet ultrices vestibulum. Morbi ac mauris risus, in molestie purus. Aliquam quis urna tellus. Ut id justo vitae nisl adipiscing scelerisque. Ut bibendum massa et est eleifend nec blandit dolor porta. Nullam elementum mattis egestas.', "updated_at" = '2013-05-03 02:23:25.250055' WHERE "projects"."id" = 6
DELETE FROM "tags" WHERE "tags"."id" = 1
SELECT "tags".* FROM "tags" INNER JOIN "projects_tags" ON "tags"."id" = "projects_tags"."tag_id" WHERE "projects_tags"."project_id" = 1 AND "tags"."name" = 'testtag' LIMIT 1
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 01 May 2013 02:00:22 UTC +00:00], ["name", "testtag"], ["updated_at", Wed, 01 May 2013 02:00:22 UTC +00:00]]
---
  def update
  	if !deadline_validator(params[:project][:deadline])
			flash[:notice] = "Invalid deadline."
			redirect_to edit_project_path
	else
		  confirmed_project(params[:id])
	      @project = Project.find params[:id]
	      @project.update_attributes! params[:project]
				if(params[:tags] != nil)
					tags = params[:tags].keys
					tags.each do |tag|
						@project.tags.find_by_name(tag).delete
					end
				end
				if(params[:tag][:name] != '' && params[:tag][:name] != nil && @project.tags.find_by_name(params[:tag][:name]) == nil)
					if @tag = Tag.find_by_name(params[:tag][:name])
						@project.tags << @tag

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
---
	def destroy
    @project = Project.find(params[:id])
		if @project.admin_notification != nil
			@project.admin_notification.destroy