app/controllers/users_controller.rb

	def index
		usersort = params[:usersort] || session[:usersort]
		case usersort
    when 'username'
    	ordering,@username_header = :username, 'hilite'
    when 'firstname'
    	ordering,@first_name_header = :firstname, 'hilite'
    when 'lastname'
      ordering,@last_name_header = :lastname, 'hilite'
    when 'email'
      ordering,@email_header = :email, 'hilite'
    end
    if params[:usersort] != session[:usersort]
      session[:usersort] = usersort
			flash.keep
      redirect_to :usersort => usersort and return
    end
		ordering = "lower(#{ordering})" unless ordering ==

		if params[:search]
    		@users = User.where("users.confirmed_at IS NOT NULL").order(ordering).search(params[:search])
    	else
    		@users = User.all
---
SELECT "users".* FROM "users" WHERE (users.confirmed_at IS NOT NULL) AND (firstname LIKE '%tcharron480%' OR lastname LIKE '%tcharron480%' OR username LIKE '%tcharron480%' OR aboutme LIKE '%tcharron480%' OR email LIKE '%tcharron480%')
SELECT "users".* FROM "users" ORDER BY firstname

	def show
		confirmed_user(params[:id])
		id = params[:id]
		@user = User.find(id)
		@edit_and_delete = (@user == current_user)
		@current_user_projects = current_user.projects.where("confirmed_at IS NOT NULL")
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1

	def edit
		id = params[:id]
		@user = User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

	def update
			confirmed_user(params[:id])
	    @user = User.find params[:id]
	    @user.update_attributes!(params[:user])
			if(params[:tags] != nil)
				tags = params[:tags].keys
				tags.each do |tag|
					@user.tags.find_by_name(tag).delete
				end
			end
			if(params[:tag][:name] != '' && params[:tag][:name] != nil)
				@user.tags.create!(params[:tag])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "aboutme" = 'Curabitur consectetur dapibus dui vel luctus. Pellentesque posuere dolor dapibus turpis condimentum sodales. Integer quis nibh quis risus ornare scelerisque. Pellentesque et congue nisi. Donec feugiat, dolor in accumsan fermentum, justo enim tincidunt magna, nec mattis ligula ante id felis. Integer sed ante sit amet mauris laoreet hendrerit non id massa. Curabitur pellentesque vehicula ipsum eget convallis.
DELETE FROM "tags" WHERE "tags"."id" = 1
SELECT "tags".* FROM "tags" INNER JOIN "tags_users" ON "tags"."id" = "tags_users"."tag_id" WHERE "tags_users"."user_id" = 1 AND "tags"."name" = 'testtag' LIMIT 1
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 01 May 2013 02:00:12 UTC +00:00], ["name", "testtag"], ["updated_at", Wed, 01 May 2013 02:00:12 UTC +00:00]]
INSERT INTO "tags_users" ("user_id", "tag_id") VALUES (1, 1)

	def destroy
    @user = User.find(params[:id])
		if @notification = @user.admin_notification
			@notification.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]